ФБКРозница/src/DataProcessors/ПомощникПоУчетуНДС/ПомощникПоУчетуНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПомощникПоУчетуНДС</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

ФБКРозница/src/InformationRegisters/СостоянияБлокировкиВычетаНДСПоСчетамФактурам/СостоянияБлокировкиВычетаНДСПоСчетамФактурам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияБлокировкиВычетаНДСПоСчетамФактурам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияБлокировкиВычетаНДС</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетФактура</name>
    <type>
      <types>DefinedType.СчетФактура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ФБКРозница/src/InformationRegisters/ТребуетсяОформлениеСчетаФактуры/ТребуетсяОформлениеСчетаФактуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТребуетсяОформлениеСчетаФактуры</name>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ЗаписьКнигиПродаж</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ФБКРозница/src/InformationRegisters/ДанныеПервичныхДокументов/ДанныеПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПервичныхДокументов</name>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистратора</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НомерРегистратора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.ЗаписьКнигиПокупок</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
      <types>DocumentRef.СчетФактураПолученныйАванс</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.ВнесениеДенежныхСредствВКассуККМ</types>
      <types>DocumentRef.РасчетКурсовыхРазниц</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.СчетФактураНаНеподтвержденнуюРеализацию0</types>
      <types>DocumentRef.РаспределениеДоходовИРасходовПоНаправлениямДеятельности</types>
      <types>DocumentRef.ПеремаркировкаТоваровГИСМ</types>
      <types>DocumentRef.ОперацияПоЯндексКассе</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ПоступлениеТоваров</types>
      <types>DocumentRef.ПрочиеДоходыРасходы</types>
      <types>DocumentRef.СчетФактураВыданныйАванс</types>
      <types>DocumentRef.МаркировкаТоваровГИСМ</types>
      <types>DocumentRef.КорректировкаНалогообложенияНДСПартийТоваров</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.РаспределениеРасходовБудущихПериодов</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.СписаниеНДСНаРасходы</types>
      <types>DocumentRef.СписаниеНедостачТоваров</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ЗаявлениеОВвозеТоваров</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
      <types>DocumentRef.КорректировкаНазначенияТоваров</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.ОтчетКомитентуОСписании</types>
      <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.АннулированиеПодарочныхСертификатов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</types>
      <types>DocumentRef.ОприходованиеИзлишковТоваров</types>
      <types>DocumentRef.СписаниеЗадолженности</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.СчетФактураКомиссионеру</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ВыкупВозвратнойТарыУПоставщика</types>
      <types>DocumentRef.ВзаимозачетЗадолженности</types>
      <types>DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</types>
      <types>DocumentRef.РасчетСебестоимостиТоваров</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.НачисленияКредитовИДепозитов</types>
      <types>DocumentRef.РеализацияПодарочныхСертификатов</types>
      <types>DocumentRef.ЗаписьКнигиПродаж</types>
      <types>DocumentRef.ВозвратПодарочныхСертификатов</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.КорректировкаВидаДеятельностиНДС</types>
      <types>DocumentRef.ПорчаТоваров</types>
      <types>DocumentRef.СчетФактураНалоговыйАгент</types>
      <types>DocumentRef.СчетФактураКомитента</types>
      <types>DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</types>
      <types>DocumentRef.РаспределениеНДС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ФБКРозница/src/InformationRegisters/СчетаФактурыКомитентовКРегистрации/СчетаФактурыКомитентовКРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаФактурыКомитентовКРегистрации</name>
  <resources>
    <name>СуммаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Субкомиссионер</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <dimensions>
    <name>СчетФактураВыданный</name>
    <type>
      <types>DocumentRef.СчетФактураВыданный</types>
      <types>DocumentRef.СчетФактураКомиссионеру</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комитент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ФБКРозница/src/InformationRegisters/СчетаФактурыКомиссионерамКОформлению/СчетаФактурыКомиссионерамКОформлению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаФактурыКомиссионерамКОформлению</name>
  <resources>
    <name>СуммаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссионер</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОтчетКомиссионера</name>
    <type>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСчетаФактуры</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСчетаФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ФБКРозница/src/AccumulationRegisters/ТоварыКОформлениюЗаявленийОВвозе/ТоварыКОформлениюЗаявленийОВвозе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОформлениюЗаявленийОВвозе</name>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактурнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ФБКРозница/src/InformationRegisters/НДССостояниеРеализации0/НДССостояниеРеализации0.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НДССостояниеРеализации0</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.НДССостоянияРеализация0</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРеализации</name>
    <type>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ФБКРозница/src/Enums/СостоянияБлокировкиВычетаНДС/СостоянияБлокировкиВычетаНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияБлокировкиВычетаНДС</name>
  <enumValues>
    <name>Установлена</name>
  </enumValues>
  <enumValues>
    <name>Снята</name>
  </enumValues>
</mdclass:Enum>

ФБКРозница/src/Enums/ПорядокРегистрацииСчетовФактурНаАванс/ПорядокРегистрацииСчетовФактурНаАванс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокРегистрацииСчетовФактурНаАванс</name>
  <enumValues>
    <name>ВсеОплаты</name>
  </enumValues>
  <enumValues>
    <name>КромеЗачтенныхВТечениеДня</name>
  </enumValues>
  <enumValues>
    <name>КромеЗачтенныхВТечениеПятиДней</name>
  </enumValues>
  <enumValues>
    <name>КромеЗачтенныхВТечениеМесяца</name>
  </enumValues>
  <enumValues>
    <name>КромеЗачтенныхВТечениеНалоговогоПериода</name>
  </enumValues>
  <enumValues>
    <name>НеРегистрироватьСчетаФактурыНаАвансы</name>
  </enumValues>
</mdclass:Enum>

ФБКРозница/src/DataProcessors/ПомощникПоУчетуНДС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает информацию о количестве документов по учету НДС к обработке по организации за период.
//
// Параметры:
//	ПараметрыЗапроса - Структура вида "МассивОрганизаций, НачалоПериода, КонецПериода"
//	СтруктураВидимостиЭлементов - Структура, определяет - формировать ли запрос по документу. 
// 									См. ПолучитьСтруктуруВидимостиЭлементов()
//	ТолькоОбязательныеОперации - Булево, Отбирать для анализа только обязательыне операции (требуется для 
//									индикации состояния в помощнике закрытия месяца)
// Возвращаемое значение:
//	ТаблицаЗначений - Таблица документов в обработке и уже сформированных (Документ, КоличествоКОформлению, КоличествоОформленных)
//
Функция СформироватьЗапросПоДокументамКОформлению(ПараметрыЗапроса, СтруктураВидимостиЭлементов = Неопределено, ТолькоОбязательныеОперации = Ложь) Экспорт
	
	Если СтруктураВидимостиЭлементов = Неопределено Тогда
		СтруктураВидимостиЭлементов = ВидимостьЭлементов(ПараметрыЗапроса.МассивОрганизаций, ПараметрыЗапроса.НачалоПериода);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыЗапроса.КонецПериода) Тогда
		ПараметрыЗапроса.КонецПериода = Дата('209901010000');
	КонецЕсли;
	
	МассивОрганизаций = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ПараметрыЗапроса.МассивОрганизаций);
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(
		МассивОрганизаций,
		Справочники.Организации.УправленческаяОрганизация);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОрганизаций",		МассивОрганизаций);
	Запрос.УстановитьПараметр("НачалоПериода",			ПараметрыЗапроса.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",			ПараметрыЗапроса.КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаГраница",	Новый Граница(ПараметрыЗапроса.КонецПериода));
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстыЗапросов.Добавить(ТекстЗапросаСчетФактураВыданный(СтруктураВидимостиЭлементов, ПараметрыЗапроса));
	ТекстыЗапросов.Добавить(ТекстЗапросаСчетФактураВыданныйАванс(СтруктураВидимостиЭлементов, ПараметрыЗапроса));
	ТекстыЗапросов.Добавить(ТекстЗапросаСчетФактураКомиссионеру(СтруктураВидимостиЭлементов, ПараметрыЗапроса));
	ТекстыЗапросов.Добавить(ТекстЗапросаЗаявлениеОВвозеТоваров(СтруктураВидимостиЭлементов, ПараметрыЗапроса));
	ТекстыЗапросов.Добавить(ТекстЗапросаСчетФактураНалоговыйАгент(СтруктураВидимостиЭлементов, ПараметрыЗапроса));
	
	Если ТолькоОбязательныеОперации = Ложь Тогда
		
		ТекстыЗапросов.Добавить(ТекстЗапросаСчетФактураПолученный(СтруктураВидимостиЭлементов, ПараметрыЗапроса));
		ТекстыЗапросов.Добавить(ТекстЗапросаСчетФактураПолученныйАванс(СтруктураВидимостиЭлементов, ПараметрыЗапроса));
		ТекстыЗапросов.Добавить(ТекстЗапросаСчетФактураКомитента(СтруктураВидимостиЭлементов, ПараметрыЗапроса));
		ТекстыЗапросов.Добавить(ТекстЗапросаНДССостояниеРеализации0(СтруктураВидимостиЭлементов, ПараметрыЗапроса));
		
	КонецЕсли;
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СформироватьЗапросПоПрочимОперациям(ПараметрыЗапроса) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПараметрыЗапроса.КонецПериода) Тогда
		ПараметрыЗапроса.КонецПериода = Дата('209901010000');
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК Количество
	|ИЗ
	|	Документ.ЗаписьКнигиПродаж КАК ЗаписьКнигиПродаж
	|ГДЕ
	|	ЗаписьКнигиПродаж.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗаписьКнигиПродаж.Организация В (&МассивОрганизаций)
	|	И ЗаписьКнигиПродаж.Проведен
	|;
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК Количество
	|ИЗ
	|	Документ.ЗаписьКнигиПокупок КАК ЗаписьКнигиПокупок
	|ГДЕ
	|	ЗаписьКнигиПокупок.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗаписьКнигиПокупок.Организация В (&МассивОрганизаций)
	|	И ЗаписьКнигиПокупок.Проведен
	|;
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК Количество
	|ИЗ
	|	РегистрСведений.СостоянияБлокировкиВычетаНДСПоСчетамФактурам.СрезПоследних(
	|		&КонецПериода, 
	|		Организация В (&МассивОрганизаций)) КАК СостоянияБлокировки 
	|ГДЕ
	|	СостоянияБлокировки.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияБлокировкиВычетаНДС.Установлена)
	|;
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК Количество
	|ИЗ
	|	Документ.СписаниеНДСнаРасходы КАК СписаниеНДСнаРасходы
	|ГДЕ
	|	СписаниеНДСнаРасходы.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СписаниеНДСнаРасходы.Организация В (&МассивОрганизаций)
	|	И СписаниеНДСнаРасходы.Проведен
	|";
	
	Запрос.УстановитьПараметр("НачалоПериода",		ПараметрыЗапроса.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",		ПараметрыЗапроса.КонецПериода);
	Запрос.УстановитьПараметр("МассивОрганизаций",  ПараметрыЗапроса.МассивОрганизаций);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаписиКнигиПродаж",   0);
	Результат.Вставить("ЗаписиКнигиПокупок",  0);
	Результат.Вставить("БлокировкиВычетаНДС", 0);
	Результат.Вставить("СписанияНДСнаРасходы", 0);
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Вставить("ЗаписиКнигиПродаж", Выборка.Количество);
	КонецЕсли;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Вставить("ЗаписиКнигиПокупок", Выборка.Количество);
	КонецЕсли;
	
	Выборка = РезультатЗапроса[2].Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Вставить("БлокировкиВычетаНДС", Выборка.Количество);
	КонецЕсли;

	Выборка = РезультатЗапроса[3].Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Вставить("СписанияНДСнаРасходы", Выборка.Количество);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает информацию о количестве документов по учету НДС к обработке по организации за период.
//
// Параметры:
//	ПараметрыЗапроса - Структура вида "МассивОрганизаций, НачалоПериода, КонецПериода"
//
// Возвращаемое значение:
//	Структура - (ЕстьНевыполненныеОперации, ЕстьОбязательныеНевыполненныеОперации), тип элементов структуры - булево 
//
Функция ОперацииПоНДСКВыполнению(ПараметрыЗапроса) Экспорт
	
	НевыполненныеОперации = 0;
	ОбязательныеНевыполненныеОперации = 0;
	
	ТолькоОбязательныеОперации = Истина;
	СтруктураВидимостиЭлементов = Неопределено;
	ТаблицаНевыполненныхОпераций = СформироватьЗапросПоДокументамКОформлению(ПараметрыЗапроса, СтруктураВидимостиЭлементов, ТолькоОбязательныеОперации);
	Для Каждого Строка Из ТаблицаНевыполненныхОпераций Цикл
		
		Если	Строка.Документ = "СчетФактураВыданный" 
			Или Строка.Документ = "СчетФактураВыданныйАванс" 
			Или Строка.Документ = "СчетФактураКомиссионеру"
			Или Строка.Документ = "ЗаявлениеОВвозеТоваров"
			Или Строка.Документ = "СчетФактураНалоговыйАгент" Тогда
			
			ОбязательныеНевыполненныеОперации = ОбязательныеНевыполненныеОперации + Строка.КоличествоКОформлению;
		КонецЕсли;
		
		НевыполненныеОперации = НевыполненныеОперации + Строка.КоличествоКОформлению;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("НевыполненныеОперации", НевыполненныеОперации);
	Результат.Вставить("ОбязательныеНевыполненныеОперации", ОбязательныеНевыполненныеОперации);
	Результат.Вставить("ЕстьОперацииКВыполнению", (НевыполненныеОперации > 0));
	Результат.Вставить("ЕстьОбязательныеОперацииКВыполнению", (ОбязательныеНевыполненныеОперации > 0));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ТекстыЗапросов

Функция ТекстЗапросаСчетФактураВыданный(СтруктураВидимостиЭлементов, Параметры)
	
	ИмяИсточника = "СчетФактураВыданный";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ИмяИсточника КАК Документ,
	|	0 КАК КоличествоКОформлению,
	|	0 КАК КоличествоОформленных";
	
	Если СтруктураВидимостиЭлементов[ИмяИсточника] Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&ИмяИсточника КАК Документ,
		|	СУММА(ДанныеКОформлению.КоличествоДокументовКОформлению) КАК КоличествоКОформлению,
		|	СУММА(ДанныеКОформлению.КоличествоОформленыхДокументов) КАК КоличествоОформленных
		|ИЗ
		|	(ВЫБРАТЬ
		|		1 КАК КоличествоДокументовКОформлению,
		|		0 КАК КоличествоОформленыхДокументов
		|	ИЗ
		|		РегистрСведений.ТребуетсяОформлениеСчетаФактуры КАК ТребуетсяОформлениеСчетаФактуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ 
		|			РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеОснования
		|		ПО 
		|			ТребуетсяОформлениеСчетаФактуры.Организация = ДанныеОснования.Организация
		|			И ТребуетсяОформлениеСчетаФактуры.Основание = ДанныеОснования.Документ
		|	ГДЕ
		|		ЕСТЬNULL(ДанныеОснования.Дата, ДАТАВРЕМЯ(1,1,1)) <= &КонецПериода
		|		И ТребуетсяОформлениеСчетаФактуры.Организация В (&МассивОрганизаций)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		0,
		|		КОЛИЧЕСТВО(СчетФактураВыданный.Ссылка)
		|	ИЗ
		|		Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|	ГДЕ
		|		НЕ СчетФактураВыданный.ПометкаУдаления
		|		И СчетФактураВыданный.Организация В (&МассивОрганизаций)
		|		И СчетФактураВыданный.Дата МЕЖДУ &НачалоПериода И &КонецПериода) КАК ДанныеКОформлению";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяИсточника", """" + ИмяИсточника + """");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСчетФактураПолученный(СтруктураВидимостиЭлементов, Параметры)
	
	ИмяИсточника = "СчетФактураПолученный";
	
	ТекстЗапроса = РазделительЗапросов() +
	"ВЫБРАТЬ
	|	&ИмяИсточника КАК Документ,
	|	&КоличествоКОформлению КАК КоличествоКОформлению,
	|	КОЛИЧЕСТВО(СчетФактураПолученный.Ссылка) КАК КоличествоОформленных
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	НЕ СчетФактураПолученный.ПометкаУдаления
	|	И СчетФактураПолученный.Организация В (&МассивОрганизаций)
	|	И СчетФактураПолученный.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|";
	
	Если СтруктураВидимостиЭлементов[ИмяИсточника] Тогда
	
		ПараметрыПоискаСчетовФактур = УчетНДС.НовыйПараметрыПоискаСчетовФактур();		

		ПараметрыПоискаСчетовФактур.НачалоПериода 	= Параметры.НачалоПериода;
		ПараметрыПоискаСчетовФактур.КонецПериода 	= Параметры.КонецПериода;
		ПараметрыПоискаСчетовФактур.Организация		= Параметры.МассивОрганизаций;
		ПараметрыПоискаСчетовФактур.Фильтр			= Неопределено;
		ПараметрыПоискаСчетовФактур.ВсеКромеФильтра	= Истина;
		ПараметрыПоискаСчетовФактур.НаличиеСчетаФактуры = Ложь;
		ПараметрыПоискаСчетовФактур.СчетФактураПроведен = Неопределено;
		ПараметрыПоискаСчетовФактур.ДатаСФНеБолее		= Неопределено;
		ПараметрыПоискаСчетовФактур.ИскатьПоОборотам	= Ложь;

		ТаблицаДокументов = УчетНДСПереопределяемый.ОпределитьНаличиеСчетовФактурПолученных(ПараметрыПоискаСчетовФактур);
		КоличествоДокументов = ТаблицаДокументов.Количество();
		
	Иначе
		КоличествоДокументов = 0;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КоличествоКОформлению", Формат(КоличествоДокументов, "ЧН=; ЧГ=0"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяИсточника", """" + ИмяИсточника + """");
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСчетФактураВыданныйАванс(СтруктураВидимостиЭлементов, Параметры)
	
	ИмяИсточника = "СчетФактураВыданныйАванс";
	
	ТекстЗапроса = РазделительЗапросов() +
	"ВЫБРАТЬ
	|	&ИмяИсточника КАК Документ,
	|	&КоличествоКОформлению КАК КоличествоКОформлению,
	|	КОЛИЧЕСТВО(СчетФактураВыданныйАванс.Ссылка) КАК КоличествоОформленных
	|ИЗ
	|	Документ.СчетФактураВыданныйАванс КАК СчетФактураВыданныйАванс
	|ГДЕ
	|	НЕ СчетФактураВыданныйАванс.ПометкаУдаления
	|	И СчетФактураВыданныйАванс.Организация В (&МассивОрганизаций)
	|	И СчетФактураВыданныйАванс.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|";
	
	Если СтруктураВидимостиЭлементов[ИмяИсточника] Тогда
		ПолученныеАвансы = Новый ТаблицаЗначений;
		ПолученныеАвансы.Колонки.Добавить("СФсформирован");
		ПолученныеАвансы.Колонки.Добавить("Контрагент");
		ПолученныеАвансы.Колонки.Добавить("Сумма");
		ПолученныеАвансы.Колонки.Добавить("СтавкаНДС");
		ПолученныеАвансы.Колонки.Добавить("СуммаНДС");
		ПолученныеАвансы.Колонки.Добавить("ДокументОснование");
		ПолученныеАвансы.Колонки.Добавить("ДатаВыписки");
		ПолученныеАвансы.Колонки.Добавить("ВалютаДокумента");
		ПолученныеАвансы.Колонки.Добавить("ВалютнаяСумма");
		ПолученныеАвансы.Колонки.Добавить("СуммаСчетаФактуры");
		ПолученныеАвансы.Колонки.Добавить("СчетФактура");
		
		ОтборАвансов = Новый Структура;
		ОтборАвансов.Вставить("НачалоПериода", Параметры.НачалоПериода);
		ОтборАвансов.Вставить("КонецПериода", Параметры.КонецПериода);
		ОтборАвансов.Вставить("РасчетныйДокумент", Неопределено);
		ОтборАвансов.Вставить("Организация", Параметры.МассивОрганизаций);
		ОтборАвансов.Вставить("СтавкаНДСПоУмолчанию", Неопределено);
		ОтборАвансов.Вставить("ПравилоОтбораАванса", 
						Перечисления.ПорядокРегистрацииСчетовФактурНаАванс.ВсеОплаты);
	
		Документы.СчетФактураВыданныйАванс.ЗаполнитьПолученныеАвансыДляСФ(ОтборАвансов, ПолученныеАвансы);
		
		КоличествоДокументов = ПолученныеАвансы.НайтиСтроки(Новый Структура("СФсформирован", Ложь)).Количество();
	Иначе
		КоличествоДокументов = 0;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КоличествоКОформлению", Формат(КоличествоДокументов, "ЧН=; ЧГ=0"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяИсточника", """" + ИмяИсточника + """");
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаСчетФактураПолученныйАванс(СтруктураВидимостиЭлементов, Параметры)
	
	ИмяИсточника = "СчетФактураПолученныйАванс";
	
	ТекстЗапроса = РазделительЗапросов() +
	"ВЫБРАТЬ
	|	&ИмяИсточника КАК Документ,
	|	&КоличествоКОформлению КАК КоличествоКОформлению,
	|	КОЛИЧЕСТВО(СчетФактураПолученныйАванс.Ссылка) КАК КоличествоОформленных
	|ИЗ
	|	Документ.СчетФактураПолученныйАванс КАК СчетФактураПолученныйАванс
	|ГДЕ
	|	НЕ СчетФактураПолученныйАванс.ПометкаУдаления
	|	И СчетФактураПолученныйАванс.Организация В (&МассивОрганизаций)
	|	И СчетФактураПолученныйАванс.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|";
	
	Если СтруктураВидимостиЭлементов[ИмяИсточника] Тогда
		ПолученныеАвансы = Документы.СчетФактураПолученныйАванс.ПолучитьВыданныеАвансы(
			Параметры.МассивОрганизаций, 
			Параметры.НачалоПериода, 
			Параметры.КонецПериода);
		
		КоличествоДокументов = ПолученныеАвансы.НайтиСтроки(Новый Структура("СчетФактура", Документы.СчетФактураПолученныйАванс.ПустаяСсылка())).Количество();
	Иначе
		КоличествоДокументов = 0;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КоличествоКОформлению", Формат(КоличествоДокументов, "ЧН=; ЧГ=0"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяИсточника", """" + ИмяИсточника + """");
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаСчетФактураНалоговыйАгент(СтруктураВидимостиЭлементов, Параметры)
	
	ИмяИсточника = "СчетФактураНалоговыйАгент";
	
	ТекстЗапроса = РазделительЗапросов() +
	"ВЫБРАТЬ
	|	&ИмяИсточника КАК Документ,
	|	&КоличествоКОформлению КАК КоличествоКОформлению,
	|	КОЛИЧЕСТВО(СчетФактураНалоговыйАгент.Ссылка) КАК КоличествоОформленных
	|ИЗ
	|	Документ.СчетФактураНалоговыйАгент КАК СчетФактураНалоговыйАгент
	|ГДЕ
	|	НЕ СчетФактураНалоговыйАгент.ПометкаУдаления
	|	И СчетФактураНалоговыйАгент.Организация В (&МассивОрганизаций)
	|	И СчетФактураНалоговыйАгент.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|";
	
	Если СтруктураВидимостиЭлементов[ИмяИсточника] Тогда
		
		ОплатыПоставщикам = Новый ТаблицаЗначений;
		ОплатыПоставщикам.Колонки.Добавить("СчетФактура");
		ОплатыПоставщикам.Колонки.Добавить("СФсформирован");
		ОплатыПоставщикам.Колонки.Добавить("СтавкаНДС");
		ОплатыПоставщикам.Колонки.Добавить("ВидАгентскогоДоговора");
		ОплатыПоставщикам.Колонки.Добавить("ЮрФизЛицо");
		ОплатыПоставщикам.Колонки.Добавить("СуммаНДС");
		ОплатыПоставщикам.Колонки.Добавить("Сумма");
		
		ОтборРасчетов = Документы.СчетФактураНалоговыйАгент.ОтборРасчетов();
		ОтборРасчетов.НачалоПериода = Параметры.НачалоПериода;
		ОтборРасчетов.КонецПериода = Параметры.КонецПериода;
		ОтборРасчетов.Организация = Параметры.МассивОрганизаций;
		
		Документы.СчетФактураНалоговыйАгент.ЗаполнитьОплатыПоставщикам(ОтборРасчетов, ОплатыПоставщикам);
		
		КоличествоДокументов = ОплатыПоставщикам.НайтиСтроки(Новый Структура("СФсформирован", Ложь)).Количество();
		
	Иначе
		КоличествоДокументов = 0;
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&КоличествоКОформлению", Формат(КоличествоДокументов, "ЧН=; ЧГ=0"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяИсточника", """" + ИмяИсточника + """");
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаСчетФактураКомитента(СтруктураВидимостиЭлементов, Параметры)
	
	ИмяИсточника = "СчетФактураКомитента";
	
	ТекстЗапроса = РазделительЗапросов() +
	"ВЫБРАТЬ
	|	&ИмяИсточника КАК Документ,
	|	0 КАК КоличествоКОформлению,
	|	КОЛИЧЕСТВО(СчетФактураКомитента.Ссылка) КАК КоличествоОформленных
	|ИЗ
	|	Документ.СчетФактураКомитента КАК СчетФактураКомитента
	|ГДЕ
	|	НЕ СчетФактураКомитента.ПометкаУдаления
	|	И СчетФактураКомитента.Организация В (&МассивОрганизаций)
	|	И СчетФактураКомитента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|";
	
	Если СтруктураВидимостиЭлементов[ИмяИсточника] Тогда
		
		ТекстЗапроса = РазделительЗапросов() +
		"ВЫБРАТЬ
		|	&ИмяИсточника КАК Документ,
		|	СУММА(Подзапрос.КоличествоКОформлению),
		|	СУММА(Подзапрос.КоличествоОформленных)
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(КРегистрации.СчетФактураВыданный) КАК КоличествоКОформлению,
		|		0 КАК КоличествоОформленных
		|	ИЗ
		|		РегистрСведений.СчетаФактурыКомитентовКРегистрации КАК КРегистрации
		|	ГДЕ
		|		КРегистрации.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|		И КРегистрации.Организация В (&МассивОрганизаций)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		0,
		|		КОЛИЧЕСТВО(СчетФактураКомитента.Ссылка)
		|	ИЗ
		|		Документ.СчетФактураКомитента КАК СчетФактураКомитента
		|	ГДЕ
		|		СчетФактураКомитента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|		И СчетФактураКомитента.Организация В (&МассивОрганизаций)
		|		И НЕ СчетФактураКомитента.ПометкаУдаления) КАК Подзапрос";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяИсточника", """" + ИмяИсточника + """");
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаСчетФактураКомиссионеру(СтруктураВидимостиЭлементов, Параметры)
	
	ИмяИсточника = "СчетФактураКомиссионеру";
	
	ТекстЗапроса = РазделительЗапросов() +
	"ВЫБРАТЬ
	|	&ИмяИсточника КАК Документ,
	|	0 КАК КоличествоКОформлению,
	|	КОЛИЧЕСТВО(СчетФактураКомиссионеру.Ссылка) КАК КоличествоОформленных
	|ИЗ
	|	Документ.СчетФактураКомиссионеру КАК СчетФактураКомиссионеру
	|ГДЕ
	|	НЕ СчетФактураКомиссионеру.ПометкаУдаления
	|	И СчетФактураКомиссионеру.Организация В (&МассивОрганизаций)
	|	И СчетФактураКомиссионеру.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|";
	
	Если СтруктураВидимостиЭлементов[ИмяИсточника] Тогда
		
		ТекстЗапроса = РазделительЗапросов() +
		"ВЫБРАТЬ
		|	&ИмяИсточника КАК Документ,
		|	СУММА(Подзапрос.КоличествоКОформлению),
		|	СУММА(Подзапрос.КоличествоОформленных)
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(КОформлению.ОтчетКомиссионера) КАК КоличествоКОформлению,
		|		0 КАК КоличествоОформленных
		|	ИЗ
		|		РегистрСведений.СчетаФактурыКомиссионерамКОформлению КАК КОформлению
		|	ГДЕ
		|		КОформлению.ДатаСчетаФактуры МЕЖДУ &НачалоПериода И &КонецПериода
		|		И КОформлению.Организация В (&МассивОрганизаций)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		0,
		|		КОЛИЧЕСТВО(СчетФактураКомиссионеру.Ссылка)
		|	ИЗ
		|		Документ.СчетФактураКомиссионеру КАК СчетФактураКомиссионеру
		|	ГДЕ
		|		СчетФактураКомиссионеру.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|		И СчетФактураКомиссионеру.Организация В (&МассивОрганизаций)
		|		И НЕ СчетФактураКомиссионеру.ПометкаУдаления) КАК Подзапрос";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяИсточника", """" + ИмяИсточника + """");
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаЗаявлениеОВвозеТоваров(СтруктураВидимостиЭлементов, Параметры)
	
	ИмяИсточника = "ЗаявлениеОВвозеТоваров";
	
	ТекстЗапроса = РазделительЗапросов() +
	"ВЫБРАТЬ
	|	&ИмяИсточника КАК Документ,
	|	0 КАК КоличествоКОформлению,
	|	КОЛИЧЕСТВО(ЗаявлениеОВвозеТоваров.Ссылка) КАК КоличествоОформленных
	|ИЗ
	|	Документ.ЗаявлениеОВвозеТоваров КАК ЗаявлениеОВвозеТоваров
	|ГДЕ
	|	НЕ ЗаявлениеОВвозеТоваров.ПометкаУдаления
	|	И ЗаявлениеОВвозеТоваров.Организация В (&МассивОрганизаций)
	|	И ЗаявлениеОВвозеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|";
	
	Если СтруктураВидимостиЭлементов[ИмяИсточника] Тогда
		
		ТекстЗапроса = РазделительЗапросов() +
		"ВЫБРАТЬ
		|	&ИмяИсточника КАК Документ,
		|	СУММА(Подзапрос.КоличествоКОформлению),
		|	СУММА(Подзапрос.КоличествоОформленных)
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДокументПриобретениеТоваровУслуг.Ссылка) КАК КоличествоКОформлению,
		|		0 КАК КоличествоОформленных
		|	ИЗ
		|		Документ.ПриобретениеТоваровУслуг КАК ДокументПриобретениеТоваровУслуг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОформлениюЗаявленийОВвозе.Остатки(&КонецПериодаГраница) КАК ТоварыКОформлениюЗаявленийОВвозеОстатки
		|			ПО ДокументПриобретениеТоваровУслуг.Ссылка = ТоварыКОформлениюЗаявленийОВвозеОстатки.ДокументПоступления
		|	ГДЕ
		|		ДокументПриобретениеТоваровУслуг.Организация В (&МассивОрганизаций)
		|		И ДокументПриобретениеТоваровУслуг.Дата <= &КонецПериода 
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		0,
		|		КОЛИЧЕСТВО(ЗаявлениеОВвозеТоваров.Ссылка)
		|	ИЗ
		|		Документ.ЗаявлениеОВвозеТоваров КАК ЗаявлениеОВвозеТоваров
		|	ГДЕ
		|		ЗаявлениеОВвозеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|		И ЗаявлениеОВвозеТоваров.Организация В (&МассивОрганизаций)
		|		И НЕ ЗаявлениеОВвозеТоваров.ПометкаУдаления) КАК Подзапрос";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяИсточника", """" + ИмяИсточника + """");
	
	Возврат ТекстЗапроса;

КонецФункции


Функция ТекстЗапросаНДССостояниеРеализации0(СтруктураВидимостиЭлементов, Параметры)
	
	ИмяИсточника = "НДССостояниеРеализации0";
	
	ТекстЗапроса = РазделительЗапросов() +
	"ВЫБРАТЬ
	|	&ИмяИсточника КАК НаименованиеИсточника,
	|	0 КАК КоличествоКОформлению,
	|	КОЛИЧЕСТВО(НДССостояниеРеализации0.ДокументРеализации) КАК КоличествоОформленных
	|ИЗ
	|	РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
	|ГДЕ
	|	НДССостояниеРеализации0.Организация В (&МассивОрганизаций)
	|	И НДССостояниеРеализации0.ДатаРеализации МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|";
	
	Если СтруктураВидимостиЭлементов[ИмяИсточника] Тогда
		
		ТекстЗапроса = РазделительЗапросов() +
		"ВЫБРАТЬ
		|	&ИмяИсточника КАК НаименованиеИсточника,
		|	СУММА(Подзапрос.КоличествоКОформлению),
		|	СУММА(Подзапрос.КоличествоОформленных)
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(НДССостояниеРеализации0.ДокументРеализации) КАК КоличествоКОформлению,
		|		0 КАК КоличествоОформленных
		|	ИЗ
		|		РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
		|	ГДЕ
		|		НДССостояниеРеализации0.Организация В (&МассивОрганизаций)
		|		И НДССостояниеРеализации0.ДатаРеализации <= &КонецПериода
		|		И НДССостояниеРеализации0.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КОЛИЧЕСТВО(НДССостояниеРеализации0.ДокументРеализации) КАК КоличествоКОформлению,
		|		0 КАК КоличествоОформленных
		|	ИЗ
		|		РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
		|	ГДЕ
		|		НДССостояниеРеализации0.Организация В (&МассивОрганизаций)
		|		И НДССостояниеРеализации0.ДатаРеализации <= &КонецПериода
		|		И НДССостояниеРеализации0.ДатаПодтверждения > &КонецПериода
		|		И НДССостояниеРеализации0.Состояние В (
		|			ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ПодтвержденаРеализация0),
		|			ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.НеПодтвержденаРеализация0))
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		0 КАК КоличествоКОформлению,
		|		КОЛИЧЕСТВО(НДССостояниеРеализации0.ДокументРеализации) КАК КоличествоОформленных
		|	ИЗ
		|		РегистрСведений.НДССостояниеРеализации0 КАК НДССостояниеРеализации0
		|	ГДЕ
		|		НДССостояниеРеализации0.Организация В (&МассивОрганизаций)
		|		И НДССостояниеРеализации0.ДатаПодтверждения МЕЖДУ &НачалоПериода И &КонецПериода
		|		И НДССостояниеРеализации0.Состояние В (
		|			ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ПодтвержденаРеализация0),
		|			ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.НеПодтвержденаРеализация0))
		|	) КАК Подзапрос";
	
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяИсточника", """" + ИмяИсточника + """");
	
	Возврат ТекстЗапроса;

КонецФункции

Функция РазделительЗапросов()
	Возврат 
		"
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|";
КонецФункции

#КонецОбласти
	
#Область Прочее

Функция ВидимостьЭлементов(Организация, Период) Экспорт
	
	ПрименяетсяУСН = УчетнаяПолитика.ПрименяетсяУСН(Организация, Период);
	
	СтруктураВидимостиЭлементов = Новый Структура;
	СтруктураВидимостиЭлементов.Вставить("СчетФактураВыданный",			Истина);
	СтруктураВидимостиЭлементов.Вставить("СчетФактураПолученный",		Истина);
	СтруктураВидимостиЭлементов.Вставить("СчетФактураВыданныйАванс",	Не ПрименяетсяУСН);
	СтруктураВидимостиЭлементов.Вставить("СчетФактураПолученныйАванс",	НЕ ПрименяетсяУСН);
	СтруктураВидимостиЭлементов.Вставить("СчетФактураНалоговыйАгент",	Истина);
	СтруктураВидимостиЭлементов.Вставить("СчетФактураКомитента",		ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриЗакупках"));
	СтруктураВидимостиЭлементов.Вставить("СчетФактураКомиссионеру",		ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриПродажах"));
	СтруктураВидимостиЭлементов.Вставить("ЗаявлениеОВвозеТоваров",		ПолучитьФункциональнуюОпцию("ИспользоватьИмпортныеЗакупки"));
	СтруктураВидимостиЭлементов.Вставить("ПодтвержденияОплатыВБюджет",	ПолучитьФункциональнуюОпцию("ИспользоватьИмпортныеЗакупки"));
	
	СтруктураВидимостиЭлементов.Вставить("ФормированиеЗаписейРаздела7",			ПолучитьФункциональнуюОпцию("ИспользоватьЗаполнениеРаздела7ДекларацииПоНДС"));
	СтруктураВидимостиЭлементов.Вставить("РеестрДокументовПодтверждающихЛьготу",ПолучитьФункциональнуюОпцию("ИспользоватьЗаполнениеРаздела7ДекларацииПоНДС"));
	
	Если ПолучитьФункциональнуюОпцию("УправлениеТорговлей") Тогда
		СтруктураВидимостиЭлементов.Вставить("ТаможеннаяДекларацияЭкспорт", Ложь);
	КонецЕсли;
	
	СтруктураВидимостиЭлементов.Вставить("НДССостояниеРеализации0",		ПолучитьФункциональнуюОпцию("ИспользоватьНДС0"));
	
	Возврат СтруктураВидимостиЭлементов;
	
КонецФункции

#КонецОбласти

#Область ФормированиеГиперссылкиВЖурналеДокументыПродажи

Функция СформироватьГиперссылкуСмТакжеВРаботе(Параметры) Экспорт
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Обработки.ПомощникПоУчетуНДС) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстГиперссылки = НСтр("ru = 'Помощник по учету НДС'");
	
	Возврат Новый ФорматированнаяСтрока(ТекстГиперссылки,,,, ИмяФормыРабочееМесто());
	
КонецФункции

Функция ИмяФормыРабочееМесто() Экспорт
	
	Возврат "Обработка.ПомощникПоУчетуНДС.Форма.Форма";
	
КонецФункции

#КонецОбласти

#КонецЕсли
